In [2]:
!pip install mysqlclient
!pip install sqlalchemy

Requirement already satisfied: mysqlclient in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.2.6)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python3 -m pip install --upgrade pip
Requirement already satisfied: sqlalchemy in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.0.36)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/codespace/.local/lib/python3.12/site-packages (from sqlalchemy) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/python/3.12.1/lib/python3.12/site-packages (from sqlalchemy) (3.1.1)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python3 -m pip install --upgrade pip

In [3]:
!pip install mysqlclient

Requirement already satisfied: mysqlclient in /usr/local/python/3.12.1/lib/python3.12/site-packages (2.2.6)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python3 -m pip install --upgrade pip

In [4]:
import pandas as pd
import sqlalchemy as db

In [18]:
# funcion para devolver la conexion a la base de datos

def create_connection_db():
    engine = db.create_engine("mysql://root:root@10.0.3.5:3310/retail_db") #motor de conexion mysql
    return engine.connect()

#Nota: la direccion de ip se debe elegir de un nuevo terminar ifconfig y utilizar la ip inet de eth0

In [19]:
#Conexion
conn = create_connection_db()

In [20]:
df_customers = pd.read_sql_query("SELECT * FROM customers", con = conn)
df_customers.head()

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,00725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,00725

In [21]:
df_orders = pd.read_sql_table('orders', con=conn)
df_orders.head()

   order_id order_date  order_customer_id     order_status
0         1 2013-07-25              11599           CLOSED
1         2 2013-07-25                256  PENDING_PAYMENT
2         3 2013-07-25              12111         COMPLETE
3         4 2013-07-25               8827           CLOSED
4         5 2013-07-25              11318         COMPLETE

In [22]:
df_departments = pd.read_sql_table('departments', con=conn)

In [23]:
df_departments.to_sql(name='departments2', con=conn, if_exists='replace',index=False)

6

In [25]:
df=pd.read_sql_query('SELECT * FROM departments2', con=conn)
df.head()

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors